<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"s3","backend":"53a82430260df62ba0ed1da8290c03668476ce93ab9216d14ddd6983a1138e65","plan_job_ref":"Job Frontpage #59 at https://github.com/coverage-robot/frontpage/actions/runs/6222435596","plan_hash":"21c5ca0989ed6d99f9f7f111a7d70d12e1d27b97aab0c880a2742d08d7d3ff84","plan_text_format":"text","version":"1.36.2"} -->
Terraform plan in __./infrastructure__ in the __prod__ workspace
<details>
<summary>Plan: 1 to add, 1 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_s3_object.static_files["assets/index-5d06ebb7.js"] will be destroyed
  # (because key ["assets/index-5d06ebb7.js"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - bucket                 = "coverage-frontpage-prod" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "ca58000f3a82d5b453d0045a23b7cecb" -> null
      - force_destroy          = false -> null
      - id                     = "assets/index-5d06ebb7.js" -> null
      - key                    = "assets/index-5d06ebb7.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../dist/assets/index-5d06ebb7.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.static_files["assets/index-7f61972d.js"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + bucket                 = "coverage-frontpage-prod"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "d129b0481515951c632cba0efb8ca5b8"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/index-7f61972d.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../dist/assets/index-7f61972d.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.static_files["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
      ~ etag                   = "ada835826dce0b7d18e2bcdfa773ce7f" -> "09470bf44f1759c044dd77631b39b512"
        id                     = "index.html"
        tags                   = {}
      + version_id             = (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Frontpage #59](https://github.com/coverage-robot/frontpage/actions/runs/6222435596)